In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
df1=pd.DataFrame([[1,2,3,4],[2,3,4,6],[7,4,2,1],[6,8,33,1]],columns=['A','B','C','D'])
df1

   A  B   C  D
0  1  2   3  4
1  2  3   4  6
2  7  4   2  1
3  6  8  33  1

In [4]:
df1.head(3)

   A  B  C  D
0  1  2  3  4
1  2  3  4  6
2  7  4  2  1

In [5]:
df1.tail(1)

   A  B   C  D
3  6  8  33  1

In [6]:
df1

   A  B   C  D
0  1  2   3  4
1  2  3   4  6
2  7  4   2  1
3  6  8  33  1

In [7]:
df1.shape

(4, 4)

In [8]:
df1.iloc[0,0] #Using the iloc method in python, we can easily retrieve any particular value from a 
             #row or column by using index values.

1

In [9]:
df1.iloc[0:3,1]

0    2
1    3
2    4
Name: B, dtype: int64

In [10]:
df1.iloc[0:3,0:2]

   A  B
0  1  2
1  2  3
2  7  4

In [13]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},

          {'a': 100, 'b': 200, 'c': 300, 'd': 400},

          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
df2 = pd.DataFrame(mydict) # df2= pd.DataFrame is creating an object , DataFrame is a class in pandas
                           # A Data frame is a two-dimensional data structure

In [12]:
df2

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [14]:
df2.ndim

2